{
	"ARABIC101R": [""],
	"ASL101R": [""],
	"BET100": ["It was interesting"],
	"BET320": [""],
	"BET430": ["actually useful sales fundamentals course"],
	"BIOL150": ["So many random animal facts"],
	"CLAS101": [""],
	"CLAS104": [
		"low workload, interesting content",
		"easy course",
		"bc it was easy"
	],
	"CLAS202": ["easy, but also interesting if you read it", "easy"],
	"CS488": [
		"because computer graphics ties together all the math we learned so beautifully and visually."
	],
	"CS492": ["because it was spicy and fun"],
	"EARTH122": ["was interesting and eye opening"],
	"EARTH281": ["prof was fun to listen to and had lots of interesting stories"],
	"ECE305": ["quantum stuff is black magic and it's pretty cool"],
	"ECE457A": [
		"Othman Basir was an amazing professor and I learned so much about this course. Really changed my way of thinking for Advanced Algorithms"
	],
	"ECON101": ["only elective I took"],
	"ECON212": [
		"relatively chill game theory course, format where you play weekly games against other students is fun"
	],
	"ENGL108B": [
		"Introduction to Rhetoric: It had such a cool variety of readings and made me think more deeply about the way we communicate and interpret media."
	],
	"ENGL108P": [
		"I get to read a book for 2-3 hours a week and call it studying"
	],
	"ENGL306A": [
		"I am shocked how well humanity courses like linguistic are organized"
	],
	"FINE150": ["was pretty chill and relaxing", "", "It’s fun!"],
	"JAPAN101R": ["I am a weeb", ""],
	"MUSIC140": ["actually engaging prof and content was fun to learn", ""],
	"MUSIC246": [
		"Simon Wood is amazing and it makes me appreciate movie scores so much more",
		"it's a fun combination of (light) music theory and history, with an engaging prof (Simon Wood) who genuinely enjoys the course course content, and makes it more fun to learn. As a bonus, the \"homework\" is to watch movies, many of which are historical landmarks of the film industry.",
		"Simon Wood is my goat",
		"Simon Wood is a very engaging lecturer & he makes the 3-hour evening classes fly by"
	],
	"MUSIC275": ["easy, interesting, fresh content in course, nice prof"],
	"PSYCH101": ["interesting"],
	"PSYCH207": [
		"easy, but interesting",
		"because learning how people process information is interesting"
	],
	"SCI238": [""],
	"SFM101": [""],
	"SPCOM223": [
		"didn't have too many non-ATE electives, and just had fun with public speaking"
	]
}
