{
	"CHE102": [
		"",
		"",
		"",
		"",
		"i touched chemistry less than i touched ece106",
		"Had nothing to do with what I wanted to do as a career",
		"I don't do chemistry",
		"Will never use chemistry lol.",
		"Breadth requirement for eng, not relevant to SE whatsoever",
		"Why do I need to know chemistry?",
		"",
		"",
		"Not at all applicable to my degree",
		"",
		"We don't need chemistry in software engineering"
	],
	"CS137": [""],
	"CS348": ["writing embedded sql in C :vomit:"],
	"ECE105": [
		"Not related to what I want to do",
		"Never used what I learned and probably never will",
		"",
		"physics.",
		""
	],
	"ECE106": [
		"Physics",
		"never needed to use concepts taught in this course",
		"like what the fuck are we doing here",
		"Never had to use it ever again",
		"Software Engineer",
		"Cool course, just not very relevant",
		"Irrelevant to degree.",
		"",
		""
	],
	"ECE140": [
		"Circuits? Why?",
		"I unfortunately do not interact much with circuits, so it is not very useful",
		""
	],
	"ECE192": [
		"I have *never* had to calculate the MARR in real life",
		"did not care",
		"you could replace it with 3 powerpoints",
		"Bad",
		""
	],
	"ECE222": [
		"didn't learn a single thing from this class bcus agnew, wish i learnt something",
		"Professor was extremely unmotivated, dry content, not applicable to later courses (even if it were, there's no repetition of hardware concepts from 2B onwards so you'd forget most of it by the time you DO take another hardware course)",
		"Bad instructor",
		"Linus tech tips taught me more than gordon agnew"
	],
	"MATH213": [
		"Irrelevant",
		"didn't cover the content with enough detail to learn it",
		"I don't even remember what was in it, but I know I will never use it"
	],
	"SE380": [
		"I will never use it again",
		"I'm never going to work on controls in my life"
	],
	"SE463": [
		"Not applicable to industry",
		"The course content feels non-applicable to most work, and there is an unreasonable amount of time spent on minutiae instead of actual specifications and requirements."
	],
	"SE464": [""],
	"SE465": [""],
	"SE491": [
		"",
		"There is no lectures, no learning outcomes, nothing.",
		"its clear its a formality to graduate i was busy doing other stuff i actually cared about and this just stressed me out"
	]
}
